#include<stdio.h>
#include<stdlib.h>
//#include<C:/Users/Lenovo1/Desktop/binary_sort_tree.h>

void adminmenu()
{
	printf("**************************************************************\n\
*                                                            *\n\
*                                                            *\n\
*                     【二叉排序树操作】                     *\n\
*                                                            *\n\
*                           请选择:                          *\n\
*                                                            *\n\
*  1.二分查找插入数字   2.层序遍历插入数字   3.查找数字      *\n\
*                                                            *\n\
*  4.迭代前序遍历       5.迭代中序遍历       6.迭代后序遍历  *\n\
*                                                            *\n\
*  7.递归前序遍历       8.递归中序遍历       9.递归后序遍历  *\n\
*                                                            *\n\
*      10.层序遍历        11.删除数字      12.退出程序       *\n\
*                                                            *\n\
**************************************************************\n");
}


