#include<stdio.h>
#include<stdlib.h>
//#include<C:/Users/Lenovo1/Desktop/binary_sort_tree.h>

void adminmenu()
{
	printf("**************************************************************\n\
*                                                            *\n\
*                                                            *\n\
*                     【平衡二叉树操作】                     *\n\
*                                                            *\n\
*                           请选择:                          *\n\
*                                                            *\n\
*         1.二分查找插入数字         2.查找数字              *\n\
*                                                            *\n\
*     3.前序遍历           4.中序遍历       5.后序遍历       *\n\
*                                                            *\n\
*              6.删除数字                7.退出程序          *\n\
*                                                            *\n\
**************************************************************\n");
}
